zsj-28/PSoC6_UDB_I2C_Master/CY8CPROTO-063-BLE_Master.cydsn/Generated_Source/PSoC6/I2C_UDB.h
/*******************************************************************************
* File Name: I2C_UDB.h
* Version 3.50
*
* Description:
*  This file provides constants and parameter values for the I2C component.

*
********************************************************************************
* Copyright 2008-2015, Cypress Semiconductor Corporation. All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(CY_I2C_I2C_UDB_H)
#define CY_I2C_I2C_UDB_H

#include "cyfitter.h"
#include "cy_syslib.h"
#include "cy_sysint.h"

#define CY_ISR(FuncName)        void FuncName (void)
#define CY_ISR_PROTO(FuncName)  void FuncName (void)

/***************************************
*   Conditional Compilation Parameters
****************************************/

#define I2C_UDB_IMPLEMENTATION     (0u)
#define I2C_UDB_MODE               (2u)
#define I2C_UDB_ENABLE_WAKEUP      (0u)
#define I2C_UDB_ADDR_DECODE        (1u)
#define I2C_UDB_UDB_INTRN_CLOCK    (0u)


/* I2C implementation enum */
#define I2C_UDB_UDB    (0x00u)
#define I2C_UDB_FF     (0x01u)

#define I2C_UDB_FF_IMPLEMENTED     (I2C_UDB_FF  == I2C_UDB_IMPLEMENTATION)
#define I2C_UDB_UDB_IMPLEMENTED    (I2C_UDB_UDB == I2C_UDB_IMPLEMENTATION)

#define I2C_UDB_UDB_INTRN_CLOCK_ENABLED    (I2C_UDB_UDB_IMPLEMENTED && \
                                                     (0u != I2C_UDB_UDB_INTRN_CLOCK))
/* I2C modes enum */
#define I2C_UDB_MODE_SLAVE                 (0x01u)
#define I2C_UDB_MODE_MASTER                (0x02u)
#define I2C_UDB_MODE_MULTI_MASTER          (0x06u)
#define I2C_UDB_MODE_MULTI_MASTER_SLAVE    (0x07u)
#define I2C_UDB_MODE_MULTI_MASTER_MASK     (0x04u)

#define I2C_UDB_MODE_SLAVE_ENABLED         (0u != (I2C_UDB_MODE_SLAVE  & I2C_UDB_MODE))
#define I2C_UDB_MODE_MASTER_ENABLED        (0u != (I2C_UDB_MODE_MASTER & I2C_UDB_MODE))
#define I2C_UDB_MODE_MULTI_MASTER_ENABLED  (0u != (I2C_UDB_MODE_MULTI_MASTER_MASK & \
                                                            I2C_UDB_MODE))
#define I2C_UDB_MODE_MULTI_MASTER_SLAVE_ENABLED    (I2C_UDB_MODE_MULTI_MASTER_SLAVE == \
                                                             I2C_UDB_MODE)

/* Address detection enum */
#define I2C_UDB_SW_DECODE      (0x00u)
#define I2C_UDB_HW_DECODE      (0x01u)

#define I2C_UDB_SW_ADRR_DECODE             (I2C_UDB_SW_DECODE == I2C_UDB_ADDR_DECODE)
#define I2C_UDB_HW_ADRR_DECODE             (I2C_UDB_HW_DECODE == I2C_UDB_ADDR_DECODE)

/* Wakeup enabled */
#define I2C_UDB_WAKEUP_ENABLED             (0u != I2C_UDB_ENABLE_WAKEUP)

/* Adds bootloader APIs to component */
#define I2C_UDB_BOOTLOADER_INTERFACE_ENABLED   (I2C_UDB_MODE_SLAVE_ENABLED && \
                                                            ((CYDEV_BOOTLOADER_IO_COMP == CyBtldr_I2C_UDB) || \
                                                             (CYDEV_BOOTLOADER_IO_COMP == CyBtldr_Custom_Interface)))

/* Timeout functionality */
#define I2C_UDB_TIMEOUT_ENABLE             (0u)
#define I2C_UDB_TIMEOUT_SCL_TMOUT_ENABLE   (0u)
#define I2C_UDB_TIMEOUT_SDA_TMOUT_ENABLE   (0u)
#define I2C_UDB_TIMEOUT_PRESCALER_ENABLE   (0u)
#define I2C_UDB_TIMEOUT_IMPLEMENTATION     (0u)

/* Convert to boolean */
#define I2C_UDB_TIMEOUT_ENABLED            (0u != I2C_UDB_TIMEOUT_ENABLE)
#define I2C_UDB_TIMEOUT_SCL_TMOUT_ENABLED  (0u != I2C_UDB_TIMEOUT_SCL_TMOUT_ENABLE)
#define I2C_UDB_TIMEOUT_SDA_TMOUT_ENABLED  (0u != I2C_UDB_TIMEOUT_SDA_TMOUT_ENABLE)
#define I2C_UDB_TIMEOUT_PRESCALER_ENABLED  (0u != I2C_UDB_TIMEOUT_PRESCALER_ENABLE)

/* Timeout implementation enum. */
#define I2C_UDB_TIMEOUT_UDB    (0x00u)
#define I2C_UDB_TIMEOUT_FF     (0x01u)

#define I2C_UDB_TIMEOUT_FF_IMPLEMENTED     (I2C_UDB_TIMEOUT_FF  == \
                                                        I2C_UDB_TIMEOUT_IMPLEMENTATION)
#define I2C_UDB_TIMEOUT_UDB_IMPLEMENTED    (I2C_UDB_TIMEOUT_UDB == \
                                                        I2C_UDB_TIMEOUT_IMPLEMENTATION)

#define I2C_UDB_TIMEOUT_FF_ENABLED         (I2C_UDB_TIMEOUT_ENABLED && \
                                                     I2C_UDB_TIMEOUT_FF_IMPLEMENTED)

#define I2C_UDB_TIMEOUT_UDB_ENABLED        (I2C_UDB_TIMEOUT_ENABLED && \
                                                     I2C_UDB_TIMEOUT_UDB_IMPLEMENTED)

#define I2C_UDB_EXTERN_I2C_INTR_HANDLER    (0u)
#define I2C_UDB_EXTERN_TMOUT_INTR_HANDLER  (0u)

#define I2C_UDB_INTERN_I2C_INTR_HANDLER    (0u == I2C_UDB_EXTERN_I2C_INTR_HANDLER)
#define I2C_UDB_INTERN_TMOUT_INTR_HANDLER  (0u == I2C_UDB_EXTERN_TMOUT_INTR_HANDLER)


/***************************************
*       Type defines
***************************************/

/* Structure to save registers before go to sleep */
typedef struct
{
    uint8 enableState;

#if (I2C_UDB_FF_IMPLEMENTED)
    uint8 xcfg;
    uint8 cfg;
    uint8 addr;
    uint8 clkDiv1;
    uint8 clkDiv2;
#else
    uint8 control;
#endif /* (I2C_UDB_FF_IMPLEMENTED) */

#if (I2C_UDB_TIMEOUT_ENABLED)
    uint16 tmoutCfg;
    uint8  tmoutIntr;
#endif /* (I2C_UDB_TIMEOUT_ENABLED) */

} I2C_UDB_BACKUP_STRUCT;


/***************************************
*        Function Prototypes
***************************************/

void I2C_UDB_Init(void)                            ;
void I2C_UDB_Enable(void)                          ;

void I2C_UDB_Start(void)                           ;
void I2C_UDB_Stop(void)                            ;

#define I2C_UDB_EnableInt()        				__NVIC_EnableIRQ      (I2C_UDB_ISR_NUMBER)
#define I2C_UDB_DisableInt()       				__NVIC_DisableIRQ     (I2C_UDB_ISR_NUMBER)
#define I2C_UDB_ClearPendingInt()  				__NVIC_ClearPendingIRQ(I2C_UDB_ISR_NUMBER)
#define I2C_UDB_SetPendingInt()    				__NVIC_SetPendingIRQ  (I2C_UDB_ISR_NUMBER)
#define CyIntDisable						__NVIC_DisableIRQ
#define CyIntSetPriority					__NVIC_SetPriority
#define CyIntSetVector						Cy_SysInt_SetVector		

void I2C_UDB_SaveConfig(void)                      ;
void I2C_UDB_Sleep(void)                           ;
void I2C_UDB_RestoreConfig(void)                   ;
void I2C_UDB_Wakeup(void)                          ;

/* I2C Master functions prototypes */
#if (I2C_UDB_MODE_MASTER_ENABLED)
    /* Read and Clear status functions */
    uint8 I2C_UDB_MasterStatus(void)                ;
    uint8 I2C_UDB_MasterClearStatus(void)           ;

    /* Interrupt based operation functions */
    uint8 I2C_UDB_MasterWriteBuf(uint8 slaveAddress, uint8 * wrData, uint8 cnt, uint8 mode) \
                                                            ;
    uint8 I2C_UDB_MasterReadBuf(uint8 slaveAddress, uint8 * rdData, uint8 cnt, uint8 mode) \
                                                            ;
    uint8 I2C_UDB_MasterGetReadBufSize(void)       ;
    uint8 I2C_UDB_MasterGetWriteBufSize(void)      ;
    void  I2C_UDB_MasterClearReadBuf(void)         ;
    void  I2C_UDB_MasterClearWriteBuf(void)        ;

    /* Manual operation functions */
    uint8 I2C_UDB_MasterSendStart(uint8 slaveAddress, uint8 R_nW) \
                                                            ;
    uint8 I2C_UDB_MasterSendRestart(uint8 slaveAddress, uint8 R_nW) \
                                                            ;
    uint8 I2C_UDB_MasterSendStop(void)             ;
    uint8 I2C_UDB_MasterWriteByte(uint8 theByte)   ;
    uint8 I2C_UDB_MasterReadByte(uint8 acknNak)    ;

#endif /* (I2C_UDB_MODE_MASTER_ENABLED) */

