zsj-28/PSoC6_UDB_I2C_Master/CY8CPROTO-063-BLE_Master.cydsn/Generated_Source/PSoC6/I2C_UDB.h
/* I2C Slave functions prototypes */
#if (I2C_UDB_MODE_SLAVE_ENABLED)
    /* Read and Clear status functions */
    uint8 I2C_UDB_SlaveStatus(void)                ;
    uint8 I2C_UDB_SlaveClearReadStatus(void)       ;
    uint8 I2C_UDB_SlaveClearWriteStatus(void)      ;

    void  I2C_UDB_SlaveSetAddress(uint8 address)   ;

    /* Interrupt based operation functions */
    void  I2C_UDB_SlaveInitReadBuf(uint8 * rdBuf, uint8 bufSize) \
                                                            ;
    void  I2C_UDB_SlaveInitWriteBuf(uint8 * wrBuf, uint8 bufSize) \
                                                            ;
    uint8 I2C_UDB_SlaveGetReadBufSize(void)        ;
    uint8 I2C_UDB_SlaveGetWriteBufSize(void)       ;
    void  I2C_UDB_SlaveClearReadBuf(void)          ;
    void  I2C_UDB_SlaveClearWriteBuf(void)         ;

    /* Communication bootloader I2C Slave APIs */
    #if defined(CYDEV_BOOTLOADER_IO_COMP) && (I2C_UDB_BOOTLOADER_INTERFACE_ENABLED)
        /* Physical layer functions */
        void     I2C_UDB_CyBtldrCommStart(void) CYSMALL \
                                                            ;
        void     I2C_UDB_CyBtldrCommStop(void)  CYSMALL \
                                                            ;
        void     I2C_UDB_CyBtldrCommReset(void) CYSMALL \
                                                            ;
        cystatus I2C_UDB_CyBtldrCommWrite(const uint8 pData[], uint16 size, uint16 * count, uint8 timeOut) \
                                                        CYSMALL ;
        cystatus I2C_UDB_CyBtldrCommRead(uint8 pData[], uint16 size, uint16 * count, uint8 timeOut)  CYSMALL \
                                                            ;

        #if (CYDEV_BOOTLOADER_IO_COMP == CyBtldr_I2C_UDB)
            #define CyBtldrCommStart    I2C_UDB_CyBtldrCommStart
            #define CyBtldrCommStop     I2C_UDB_CyBtldrCommStop
            #define CyBtldrCommReset    I2C_UDB_CyBtldrCommReset
            #define CyBtldrCommWrite    I2C_UDB_CyBtldrCommWrite
            #define CyBtldrCommRead     I2C_UDB_CyBtldrCommRead
        #endif /* (CYDEV_BOOTLOADER_IO_COMP == CyBtldr_I2C_UDB) */

        /* Size of Read/Write buffers for I2C bootloader  */
        #define I2C_UDB_BTLDR_SIZEOF_READ_BUFFER   (0x80u)
        #define I2C_UDB_BTLDR_SIZEOF_WRITE_BUFFER  (0x80u)
        #define I2C_UDB_MIN_UNT16(a, b)            ( ((uint16)(a) < (b)) ? ((uint16) (a)) : ((uint16) (b)) )
        #define I2C_UDB_WAIT_1_MS                  (1u)

    #endif /* defined(CYDEV_BOOTLOADER_IO_COMP) && (I2C_UDB_BOOTLOADER_INTERFACE_ENABLED) */

#endif /* (I2C_UDB_MODE_SLAVE_ENABLED) */

/* Component interrupt handlers */
CY_ISR_PROTO(I2C_UDB_ISR);
#if ((I2C_UDB_FF_IMPLEMENTED) || (I2C_UDB_WAKEUP_ENABLED))
    CY_ISR_PROTO(I2C_UDB_WAKEUP_ISR);
#endif /* ((I2C_UDB_FF_IMPLEMENTED) || (I2C_UDB_WAKEUP_ENABLED)) */


/**********************************
*   Variable with external linkage
**********************************/

extern uint8 I2C_UDB_initVar;


/***************************************
*   Initial Parameter Constants
***************************************/

#define I2C_UDB_DATA_RATE          (100u)
#define I2C_UDB_DEFAULT_ADDR       (8u)
#define I2C_UDB_I2C_PAIR_SELECTED  (0u)

/* I2C pair enum */
#define I2C_UDB_I2C_PAIR_ANY   (0x01u) /* Any pins for I2C */
#define I2C_UDB_I2C_PAIR0      (0x01u) /* I2C0: (SCL = P12[4]) && (SCL = P12[5]) */
#define I2C_UDB_I2C_PAIR1      (0x02u) /* I2C1: (SCL = P12[0]) && (SDA = P12[1]) */

#define I2C_UDB_I2C1_SIO_PAIR  (I2C_UDB_I2C_PAIR1 == I2C_UDB_I2C_PAIR_SELECTED)
#define I2C_UDB_I2C0_SIO_PAIR  (I2C_UDB_I2C_PAIR0 == I2C_UDB_I2C_PAIR_SELECTED)


/***************************************
*            API Constants
***************************************/

/* Master/Slave control constants */
#define I2C_UDB_READ_XFER_MODE     (0x01u) /* Read */
#define I2C_UDB_WRITE_XFER_MODE    (0x00u) /* Write */
#define I2C_UDB_ACK_DATA           (0x01u) /* Send ACK */
#define I2C_UDB_NAK_DATA           (0x00u) /* Send NAK */
#define I2C_UDB_OVERFLOW_RETURN    (0xFFu) /* Send on bus in case of overflow */

#if (I2C_UDB_MODE_MASTER_ENABLED)
    /* "Mode" constants for MasterWriteBuf() or MasterReadBuf() function */
    #define I2C_UDB_MODE_COMPLETE_XFER     (0x00u) /* Full transfer with Start and Stop */
    #define I2C_UDB_MODE_REPEAT_START      (0x01u) /* Begin with a ReStart instead of a Start */
    #define I2C_UDB_MODE_NO_STOP           (0x02u) /* Complete the transfer without a Stop */

    /* Master status */
    #define I2C_UDB_MSTAT_CLEAR            (0x00u) /* Clear (initialize) status value */

    #define I2C_UDB_MSTAT_RD_CMPLT         (0x01u) /* Read complete */
    #define I2C_UDB_MSTAT_WR_CMPLT         (0x02u) /* Write complete */
    #define I2C_UDB_MSTAT_XFER_INP         (0x04u) /* Master transfer in progress */
    #define I2C_UDB_MSTAT_XFER_HALT        (0x08u) /* Transfer is halted */

    #define I2C_UDB_MSTAT_ERR_MASK         (0xF0u) /* Mask for all errors */
    #define I2C_UDB_MSTAT_ERR_SHORT_XFER   (0x10u) /* Master NAKed before end of packet */
    #define I2C_UDB_MSTAT_ERR_ADDR_NAK     (0x20u) /* Slave did not ACK */
    #define I2C_UDB_MSTAT_ERR_ARB_LOST     (0x40u) /* Master lost arbitration during communication */
    #define I2C_UDB_MSTAT_ERR_XFER         (0x80u) /* Error during transfer */

    /* Master API returns */
    #define I2C_UDB_MSTR_NO_ERROR          (0x00u) /* Function complete without error */
    #define I2C_UDB_MSTR_BUS_BUSY          (0x01u) /* Bus is busy, process not started */
    #define I2C_UDB_MSTR_NOT_READY         (0x02u) /* Master not Master on the bus or */
                                                            /*  Slave operation in progress */
    #define I2C_UDB_MSTR_ERR_LB_NAK        (0x03u) /* Last Byte Naked */
    #define I2C_UDB_MSTR_ERR_ARB_LOST      (0x04u) /* Master lost arbitration during communication */
    #define I2C_UDB_MSTR_ERR_ABORT_START_GEN  (0x05u) /* Master did not generate Start, the Slave */
                                                               /* was addressed before */

#endif /* (I2C_UDB_MODE_MASTER_ENABLED) */

#if (I2C_UDB_MODE_SLAVE_ENABLED)
    /* Slave Status Constants */
    #define I2C_UDB_SSTAT_RD_CMPLT     (0x01u) /* Read transfer complete */
    #define I2C_UDB_SSTAT_RD_BUSY      (0x02u) /* Read transfer in progress */
    #define I2C_UDB_SSTAT_RD_ERR_OVFL  (0x04u) /* Read overflow Error */
    #define I2C_UDB_SSTAT_RD_MASK      (0x0Fu) /* Read Status Mask */
    #define I2C_UDB_SSTAT_RD_NO_ERR    (0x00u) /* Read no Error */

    #define I2C_UDB_SSTAT_WR_CMPLT     (0x10u) /* Write transfer complete */
    #define I2C_UDB_SSTAT_WR_BUSY      (0x20u) /* Write transfer in progress */
    #define I2C_UDB_SSTAT_WR_ERR_OVFL  (0x40u) /* Write overflow Error */
    #define I2C_UDB_SSTAT_WR_MASK      (0xF0u) /* Write Status Mask  */
    #define I2C_UDB_SSTAT_WR_NO_ERR    (0x00u) /* Write no Error */

    #define I2C_UDB_SSTAT_RD_CLEAR     (0x0Du) /* Read Status clear */
    #define I2C_UDB_SSTAT_WR_CLEAR     (0xD0u) /* Write Status Clear */

#endif /* (I2C_UDB_MODE_SLAVE_ENABLED) */


