zsj-28/PSoC6_UDB_I2C_Master/CY8CPROTO-063-BLE_Master.cydsn/Generated_Source/PSoC6/I2C_UDB.h
/***************************************
*       I2C state machine constants
***************************************/

/* Default slave address states */
#define  I2C_UDB_SM_IDLE           (0x10u) /* Default state - IDLE */
#define  I2C_UDB_SM_EXIT_IDLE      (0x00u) /* Pass master and slave processing and go to IDLE */

/* Slave mode states */
#define  I2C_UDB_SM_SLAVE          (I2C_UDB_SM_IDLE) /* Any Slave state */
#define  I2C_UDB_SM_SL_WR_DATA     (0x11u) /* Master writes data to slave  */
#define  I2C_UDB_SM_SL_RD_DATA     (0x12u) /* Master reads data from slave */

/* Master mode states */
#define  I2C_UDB_SM_MASTER         (0x40u) /* Any master state */

#define  I2C_UDB_SM_MSTR_RD        (0x08u) /* Any master read state          */
#define  I2C_UDB_SM_MSTR_RD_ADDR   (0x49u) /* Master sends address with read */
#define  I2C_UDB_SM_MSTR_RD_DATA   (0x4Au) /* Master reads data              */

#define  I2C_UDB_SM_MSTR_WR        (0x04u) /* Any master read state           */
#define  I2C_UDB_SM_MSTR_WR_ADDR   (0x45u) /* Master sends address with write */
#define  I2C_UDB_SM_MSTR_WR_DATA   (0x46u) /* Master writes data              */

#define  I2C_UDB_SM_MSTR_HALT      (0x60u) /* Master waits for ReStart */

#define I2C_UDB_CHECK_SM_MASTER    (0u != (I2C_UDB_SM_MASTER & I2C_UDB_state))
#define I2C_UDB_CHECK_SM_SLAVE     (0u != (I2C_UDB_SM_SLAVE  & I2C_UDB_state))


/***************************************
*              Registers
***************************************/

#if (I2C_UDB_FF_IMPLEMENTED)
    /* Fixed Function registers */
    #define I2C_UDB_XCFG_REG           (*(reg8 *) I2C_UDB_I2C_FF__XCFG)
    #define I2C_UDB_XCFG_PTR           ( (reg8 *) I2C_UDB_I2C_FF__XCFG)

    #define I2C_UDB_ADDR_REG           (*(reg8 *) I2C_UDB_I2C_FF__ADR)
    #define I2C_UDB_ADDR_PTR           ( (reg8 *) I2C_UDB_I2C_FF__ADR)

    #define I2C_UDB_CFG_REG            (*(reg8 *) I2C_UDB_I2C_FF__CFG)
    #define I2C_UDB_CFG_PTR            ( (reg8 *) I2C_UDB_I2C_FF__CFG)

    #define I2C_UDB_CSR_REG            (*(reg8 *) I2C_UDB_I2C_FF__CSR)
    #define I2C_UDB_CSR_PTR            ( (reg8 *) I2C_UDB_I2C_FF__CSR)

    #define I2C_UDB_DATA_REG           (*(reg8 *) I2C_UDB_I2C_FF__D)
    #define I2C_UDB_DATA_PTR           ( (reg8 *) I2C_UDB_I2C_FF__D)

    #define I2C_UDB_MCSR_REG           (*(reg8 *) I2C_UDB_I2C_FF__MCSR)
    #define I2C_UDB_MCSR_PTR           ( (reg8 *) I2C_UDB_I2C_FF__MCSR)

    #define I2C_UDB_ACT_PWRMGR_REG     (*(reg8 *) I2C_UDB_I2C_FF__PM_ACT_CFG)
    #define I2C_UDB_ACT_PWRMGR_PTR     ( (reg8 *) I2C_UDB_I2C_FF__PM_ACT_CFG)
    #define I2C_UDB_ACT_PWR_EN         ( (uint8)  I2C_UDB_I2C_FF__PM_ACT_MSK)

    #define I2C_UDB_STBY_PWRMGR_REG    (*(reg8 *) I2C_UDB_I2C_FF__PM_STBY_CFG)
    #define I2C_UDB_STBY_PWRMGR_PTR    ( (reg8 *) I2C_UDB_I2C_FF__PM_STBY_CFG)
    #define I2C_UDB_STBY_PWR_EN        ( (uint8)  I2C_UDB_I2C_FF__PM_STBY_MSK)

    #define I2C_UDB_PWRSYS_CR1_REG     (*(reg8 *) CYREG_PWRSYS_CR1)
    #define I2C_UDB_PWRSYS_CR1_PTR     ( (reg8 *) CYREG_PWRSYS_CR1)

    #define I2C_UDB_CLKDIV1_REG    (*(reg8 *) I2C_UDB_I2C_FF__CLK_DIV1)
    #define I2C_UDB_CLKDIV1_PTR    ( (reg8 *) I2C_UDB_I2C_FF__CLK_DIV1)

    #define I2C_UDB_CLKDIV2_REG    (*(reg8 *) I2C_UDB_I2C_FF__CLK_DIV2)
    #define I2C_UDB_CLKDIV2_PTR    ( (reg8 *) I2C_UDB_I2C_FF__CLK_DIV2)

#else
    /* UDB implementation registers */
    #define I2C_UDB_CFG_REG \
            (*(reg8 *) I2C_UDB_bI2C_UDB_SyncCtl_CtrlReg__CONTROL_REG)
    #define I2C_UDB_CFG_PTR \
            ( (reg8 *) I2C_UDB_bI2C_UDB_SyncCtl_CtrlReg__CONTROL_REG)

    #define I2C_UDB_CSR_REG        (*(reg8 *) I2C_UDB_bI2C_UDB_StsReg__STATUS_REG)
    #define I2C_UDB_CSR_PTR        ( (reg8 *) I2C_UDB_bI2C_UDB_StsReg__STATUS_REG)

    #define I2C_UDB_INT_MASK_REG   (*(reg8 *) I2C_UDB_bI2C_UDB_StsReg__MASK_REG)
    #define I2C_UDB_INT_MASK_PTR   ( (reg8 *) I2C_UDB_bI2C_UDB_StsReg__MASK_REG)

    #define I2C_UDB_INT_ENABLE_REG (*(reg8 *) I2C_UDB_bI2C_UDB_StsReg__STATUS_AUX_CTL_REG)
    #define I2C_UDB_INT_ENABLE_PTR ( (reg8 *) I2C_UDB_bI2C_UDB_StsReg__STATUS_AUX_CTL_REG)

    #define I2C_UDB_DATA_REG       (*(reg8 *) I2C_UDB_bI2C_UDB_Shifter_u0__A0_REG)
    #define I2C_UDB_DATA_PTR       ( (reg8 *) I2C_UDB_bI2C_UDB_Shifter_u0__A0_REG)

    #define I2C_UDB_GO_REG         (*(reg8 *) I2C_UDB_bI2C_UDB_Shifter_u0__F1_REG)
    #define I2C_UDB_GO_PTR         ( (reg8 *) I2C_UDB_bI2C_UDB_Shifter_u0__F1_REG)

    #define I2C_UDB_GO_DONE_REG    (*(reg8 *) I2C_UDB_bI2C_UDB_Shifter_u0__A1_REG)
    #define I2C_UDB_GO_DONE_PTR    ( (reg8 *) I2C_UDB_bI2C_UDB_Shifter_u0__A1_REG)

    #define I2C_UDB_MCLK_PRD_REG   (*(reg8 *) I2C_UDB_bI2C_UDB_Master_ClkGen_u0__D0_REG)
    #define I2C_UDB_MCLK_PRD_PTR   ( (reg8 *) I2C_UDB_bI2C_UDB_Master_ClkGen_u0__D0_REG)

    #define I2C_UDB_MCLK_CMP_REG   (*(reg8 *) I2C_UDB_bI2C_UDB_Master_ClkGen_u0__D1_REG)
    #define I2C_UDB_MCLK_CMP_PTR   ( (reg8 *) I2C_UDB_bI2C_UDB_Master_ClkGen_u0__D1_REG)

    #if (I2C_UDB_MODE_SLAVE_ENABLED)
        #define I2C_UDB_ADDR_REG       (*(reg8 *) I2C_UDB_bI2C_UDB_Shifter_u0__D0_REG)
        #define I2C_UDB_ADDR_PTR       ( (reg8 *) I2C_UDB_bI2C_UDB_Shifter_u0__D0_REG)

        #define I2C_UDB_PERIOD_REG     (*(reg8 *) I2C_UDB_bI2C_UDB_Slave_BitCounter__PERIOD_REG)
        #define I2C_UDB_PERIOD_PTR     ( (reg8 *) I2C_UDB_bI2C_UDB_Slave_BitCounter__PERIOD_REG)

        #define I2C_UDB_COUNTER_REG    (*(reg8 *) I2C_UDB_bI2C_UDB_Slave_BitCounter__COUNT_REG)
        #define I2C_UDB_COUNTER_PTR    ( (reg8 *) I2C_UDB_bI2C_UDB_Slave_BitCounter__COUNT_REG)

        #define I2C_UDB_COUNTER_AUX_CTL_REG \
                                    (*(reg8 *) I2C_UDB_bI2C_UDB_Slave_BitCounter__CONTROL_AUX_CTL_REG)
        #define I2C_UDB_COUNTER_AUX_CTL_PTR \
                                    ( (reg8 *) I2C_UDB_bI2C_UDB_Slave_BitCounter__CONTROL_AUX_CTL_REG)

    #endif /* (I2C_UDB_MODE_SLAVE_ENABLED) */

#endif /* (I2C_UDB_FF_IMPLEMENTED) */


/***************************************
*        Registers Constants
***************************************/

/* I2C_UDB_I2C_IRQ */
#define I2C_UDB_ISR_NUMBER     ((uint8) I2C_UDB_I2C_IRQ__INTC_NUMBER)
/* isr can be assigned only to M4 or to M0*/
#if(I2C_UDB_I2C_IRQ_INTC_CORTEXM4_ASSIGNED)
#define I2C_UDB_ISR_PRIORITY   ((uint8) I2C_UDB_I2C_IRQ__INTC_CORTEXM4_PRIORITY)
#else
#define I2C_UDB_ISR_PRIORITY   ((uint8) I2C_UDB_I2C_IRQ__INTC_CORTEXM0P_PRIORITY)
#endif	

