zsj-28/PSoC6_UDB_I2C_Master/CY8CPROTO-063-BLE_Master.cydsn/Generated_Source/PSoC6/I2C_UDB.h
/* I2C Slave Data Register */
#define I2C_UDB_SLAVE_ADDR_MASK    (0x7Fu)
#define I2C_UDB_SLAVE_ADDR_SHIFT   (0x01u)
#define I2C_UDB_DATA_MASK          (0xFFu)
#define I2C_UDB_READ_FLAG          (0x01u)

/* Block reset constants */
#define I2C_UDB_CLEAR_REG          (0x00u)
#define I2C_UDB_BLOCK_RESET_DELAY  (2u)
#define I2C_UDB_FF_RESET_DELAY     (I2C_UDB_BLOCK_RESET_DELAY)
#define I2C_UDB_RESTORE_TIMEOUT    (255u)

#if (I2C_UDB_FF_IMPLEMENTED)
    /* XCFG I2C Extended Configuration Register */
    #define I2C_UDB_XCFG_CLK_EN        (0x80u) /* Enable gated clock to block */
    #define I2C_UDB_XCFG_I2C_ON        (0x40u) /* Enable I2C as wake up source*/
    #define I2C_UDB_XCFG_RDY_TO_SLEEP  (0x20u) /* I2C ready go to sleep */
    #define I2C_UDB_XCFG_FORCE_NACK    (0x10u) /* Force NACK all incoming transactions */
    #define I2C_UDB_XCFG_NO_BC_INT     (0x08u) /* No interrupt on byte complete */
    #define I2C_UDB_XCFG_BUF_MODE      (0x02u) /* Enable buffer mode */
    #define I2C_UDB_XCFG_HDWR_ADDR_EN  (0x01u) /* Enable Hardware address match */

    /* CFG I2C Configuration Register */
    #define I2C_UDB_CFG_SIO_SELECT     (0x80u) /* Pin Select for SCL/SDA lines */
    #define I2C_UDB_CFG_PSELECT        (0x40u) /* Pin Select */
    #define I2C_UDB_CFG_BUS_ERR_IE     (0x20u) /* Bus Error Interrupt Enable */
    #define I2C_UDB_CFG_STOP_IE        (0x10u) /* Enable Interrupt on STOP condition */
    #define I2C_UDB_CFG_CLK_RATE_MSK   (0x0Cu) /* Clock rate select */
    #define I2C_UDB_CFG_CLK_RATE_100   (0x00u) /* Clock rate select 100K */
    #define I2C_UDB_CFG_CLK_RATE_400   (0x04u) /* Clock rate select 400K */
    #define I2C_UDB_CFG_CLK_RATE_050   (0x08u) /* Clock rate select 50K  */
    #define I2C_UDB_CFG_CLK_RATE_RSVD  (0x0Cu) /* Clock rate select Invalid */
    #define I2C_UDB_CFG_EN_MSTR        (0x02u) /* Enable Master operation */
    #define I2C_UDB_CFG_EN_SLAVE       (0x01u) /* Enable Slave operation */

    #define I2C_UDB_CFG_CLK_RATE_LESS_EQUAL_50 (0x04u) /* Clock rate select <= 50kHz */
    #define I2C_UDB_CFG_CLK_RATE_GRATER_50     (0x00u) /* Clock rate select > 50kHz */

    /* CSR I2C Control and Status Register */
    #define I2C_UDB_CSR_BUS_ERROR      (0x80u) /* Active high when bus error has occurred */
    #define I2C_UDB_CSR_LOST_ARB       (0x40u) /* Set to 1 if lost arbitration in host mode */
    #define I2C_UDB_CSR_STOP_STATUS    (0x20u) /* Set if Stop has been detected */
    #define I2C_UDB_CSR_ACK            (0x10u) /* ACK response */
    #define I2C_UDB_CSR_NAK            (0x00u) /* NAK response */
    #define I2C_UDB_CSR_ADDRESS        (0x08u) /* Set in firmware 0 = status bit, 1 Address is slave */
    #define I2C_UDB_CSR_TRANSMIT       (0x04u) /* Set in firmware 1 = transmit, 0 = receive */
    #define I2C_UDB_CSR_LRB            (0x02u) /* Last received bit */
    #define I2C_UDB_CSR_LRB_ACK        (0x00u) /* Last received bit was an ACK */
    #define I2C_UDB_CSR_LRB_NAK        (0x02u) /* Last received bit was an NAK */
    #define I2C_UDB_CSR_BYTE_COMPLETE  (0x01u) /* Informs that last byte has been sent */
    #define I2C_UDB_CSR_STOP_GEN       (0x00u) /* Generate a stop condition */
    #define I2C_UDB_CSR_RDY_TO_RD      (0x00u) /* Set to receive mode */

    /* MCSR I2C Master Control and Status Register */
    #define I2C_UDB_MCSR_STOP_GEN      (0x10u) /* Firmware sets this bit to initiate a Stop condition */
    #define I2C_UDB_MCSR_BUS_BUSY      (0x08u) /* Status bit, Set at Start and cleared at Stop condition */
    #define I2C_UDB_MCSR_MSTR_MODE     (0x04u) /* Status bit, Set at Start and cleared at Stop condition */
    #define I2C_UDB_MCSR_RESTART_GEN   (0x02u) /* Firmware sets this bit to initiate a ReStart condition */
    #define I2C_UDB_MCSR_START_GEN     (0x01u) /* Firmware sets this bit to initiate a Start condition */

    /* PWRSYS_CR1 to handle Sleep */
    #define I2C_UDB_PWRSYS_CR1_I2C_REG_BACKUP  (0x04u) /* Enables, power to I2C regs while sleep */

#else
    /* CONTROL REG bits location */
    #define I2C_UDB_CTRL_START_SHIFT           (7u)
    #define I2C_UDB_CTRL_STOP_SHIFT            (6u)
    #define I2C_UDB_CTRL_RESTART_SHIFT         (5u)
    #define I2C_UDB_CTRL_NACK_SHIFT            (4u)
    #define I2C_UDB_CTRL_ANY_ADDRESS_SHIFT     (3u)
    #define I2C_UDB_CTRL_TRANSMIT_SHIFT        (2u)
    #define I2C_UDB_CTRL_ENABLE_MASTER_SHIFT   (1u)
    #define I2C_UDB_CTRL_ENABLE_SLAVE_SHIFT    (0u)
    #define I2C_UDB_CTRL_START_MASK            ((uint8) (0x01u << I2C_UDB_CTRL_START_SHIFT))
    #define I2C_UDB_CTRL_STOP_MASK             ((uint8) (0x01u << I2C_UDB_CTRL_STOP_SHIFT))
    #define I2C_UDB_CTRL_RESTART_MASK          ((uint8) (0x01u << I2C_UDB_CTRL_RESTART_SHIFT))
    #define I2C_UDB_CTRL_NACK_MASK             ((uint8) (0x01u << I2C_UDB_CTRL_NACK_SHIFT))
    #define I2C_UDB_CTRL_ANY_ADDRESS_MASK      ((uint8) (0x01u << I2C_UDB_CTRL_ANY_ADDRESS_SHIFT))
    #define I2C_UDB_CTRL_TRANSMIT_MASK         ((uint8) (0x01u << I2C_UDB_CTRL_TRANSMIT_SHIFT))
    #define I2C_UDB_CTRL_ENABLE_MASTER_MASK    ((uint8) (0x01u << I2C_UDB_CTRL_ENABLE_MASTER_SHIFT))
    #define I2C_UDB_CTRL_ENABLE_SLAVE_MASK     ((uint8) (0x01u << I2C_UDB_CTRL_ENABLE_SLAVE_SHIFT))

    /* STATUS REG bits location */
    #define I2C_UDB_STS_LOST_ARB_SHIFT         (6u)
    #define I2C_UDB_STS_STOP_SHIFT             (5u)
    #define I2C_UDB_STS_BUSY_SHIFT             (4u)
    #define I2C_UDB_STS_ADDR_SHIFT             (3u)
    #define I2C_UDB_STS_MASTER_MODE_SHIFT      (2u)
    #define I2C_UDB_STS_LRB_SHIFT              (1u)
    #define I2C_UDB_STS_BYTE_COMPLETE_SHIFT    (0u)
    #define I2C_UDB_STS_LOST_ARB_MASK          ((uint8) (0x01u << I2C_UDB_STS_LOST_ARB_SHIFT))
    #define I2C_UDB_STS_STOP_MASK              ((uint8) (0x01u << I2C_UDB_STS_STOP_SHIFT))
    #define I2C_UDB_STS_BUSY_MASK              ((uint8) (0x01u << I2C_UDB_STS_BUSY_SHIFT))
    #define I2C_UDB_STS_ADDR_MASK              ((uint8) (0x01u << I2C_UDB_STS_ADDR_SHIFT))
    #define I2C_UDB_STS_MASTER_MODE_MASK       ((uint8) (0x01u << I2C_UDB_STS_MASTER_MODE_SHIFT))
    #define I2C_UDB_STS_LRB_MASK               ((uint8) (0x01u << I2C_UDB_STS_LRB_SHIFT))
    #define I2C_UDB_STS_BYTE_COMPLETE_MASK     ((uint8) (0x01u << I2C_UDB_STS_BYTE_COMPLETE_SHIFT))

    /* AUX_CTL bits definition */
    #define I2C_UDB_COUNTER_ENABLE_MASK        (0x20u) /* Enable 7-bit counter */
    #define I2C_UDB_INT_ENABLE_MASK            (0x10u) /* Enable interrupt from status register */
    #define I2C_UDB_CNT7_ENABLE                (I2C_UDB_COUNTER_ENABLE_MASK)
    #define I2C_UDB_INTR_ENABLE                (I2C_UDB_INT_ENABLE_MASK)

#endif /* (I2C_UDB_FF_IMPLEMENTED) */


