zsj-28/PSoC6_UDB_I2C_Master/CY8CPROTO-063-BLE_Master.cydsn/Generated_Source/PSoC6/I2C_UDB.h
/***************************************
*        Marco
***************************************/

/* ACK and NACK for data and address checks */
#define I2C_UDB_CHECK_ADDR_ACK(csr)    ((I2C_UDB_CSR_LRB_ACK | I2C_UDB_CSR_ADDRESS) == \
                                                 ((I2C_UDB_CSR_LRB    | I2C_UDB_CSR_ADDRESS) &  \
                                                  (csr)))


#define I2C_UDB_CHECK_ADDR_NAK(csr)    ((I2C_UDB_CSR_LRB_NAK | I2C_UDB_CSR_ADDRESS) == \
                                                 ((I2C_UDB_CSR_LRB    | I2C_UDB_CSR_ADDRESS) &  \
                                                  (csr)))

#define I2C_UDB_CHECK_DATA_ACK(csr)    (0u == ((csr) & I2C_UDB_CSR_LRB_NAK))

/* MCSR conditions check */
#define I2C_UDB_CHECK_BUS_FREE(mcsr)       (0u == ((mcsr) & I2C_UDB_MCSR_BUS_BUSY))
#define I2C_UDB_CHECK_MASTER_MODE(mcsr)    (0u != ((mcsr) & I2C_UDB_MCSR_MSTR_MODE))

/* CSR conditions check */
#define I2C_UDB_WAIT_BYTE_COMPLETE(csr)    (0u == ((csr) & I2C_UDB_CSR_BYTE_COMPLETE))
#define I2C_UDB_WAIT_STOP_COMPLETE(csr)    (0u == ((csr) & (I2C_UDB_CSR_BYTE_COMPLETE | \
                                                                     I2C_UDB_CSR_STOP_STATUS)))
#define I2C_UDB_CHECK_BYTE_COMPLETE(csr)   (0u != ((csr) & I2C_UDB_CSR_BYTE_COMPLETE))
#define I2C_UDB_CHECK_STOP_STS(csr)        (0u != ((csr) & I2C_UDB_CSR_STOP_STATUS))
#define I2C_UDB_CHECK_LOST_ARB(csr)        (0u != ((csr) & I2C_UDB_CSR_LOST_ARB))
#define I2C_UDB_CHECK_ADDRESS_STS(csr)     (0u != ((csr) & I2C_UDB_CSR_ADDRESS))

/* Software start and end of transaction check */
#define I2C_UDB_CHECK_RESTART(mstrCtrl)    (0u != ((mstrCtrl) & I2C_UDB_MODE_REPEAT_START))
#define I2C_UDB_CHECK_NO_STOP(mstrCtrl)    (0u != ((mstrCtrl) & I2C_UDB_MODE_NO_STOP))

/* Send read or write completion depends on state */
#define I2C_UDB_GET_MSTAT_CMPLT ((0u != (I2C_UDB_state & I2C_UDB_SM_MSTR_RD)) ? \
                                                 (I2C_UDB_MSTAT_RD_CMPLT) : (I2C_UDB_MSTAT_WR_CMPLT))

/* Returns 7-bit slave address */
#define I2C_UDB_GET_SLAVE_ADDR(dataReg)   (((dataReg) >> I2C_UDB_SLAVE_ADDR_SHIFT) & \
                                                                  I2C_UDB_SLAVE_ADDR_MASK)

#if (I2C_UDB_FF_IMPLEMENTED)
    /* Check enable of module */
    #define I2C_UDB_I2C_ENABLE_REG     (I2C_UDB_ACT_PWRMGR_REG)
    #define I2C_UDB_IS_I2C_ENABLE(reg) (0u != ((reg) & I2C_UDB_ACT_PWR_EN))
    #define I2C_UDB_IS_ENABLED         (0u != (I2C_UDB_ACT_PWRMGR_REG & I2C_UDB_ACT_PWR_EN))

    #define I2C_UDB_CHECK_PWRSYS_I2C_BACKUP    (0u != (I2C_UDB_PWRSYS_CR1_I2C_REG_BACKUP & \
                                                                I2C_UDB_PWRSYS_CR1_REG))

    /* Check start condition generation */
    #define I2C_UDB_CHECK_START_GEN(mcsr)  ((0u != ((mcsr) & I2C_UDB_MCSR_START_GEN)) && \
                                                     (0u == ((mcsr) & I2C_UDB_MCSR_MSTR_MODE)))

    #define I2C_UDB_CLEAR_START_GEN        do{ \
                                                        I2C_UDB_MCSR_REG &=                                   \
                                                                           ((uint8) ~I2C_UDB_MCSR_START_GEN); \
                                                    }while(0)

    /* Stop interrupt */
    #define I2C_UDB_ENABLE_INT_ON_STOP     do{ \
                                                        I2C_UDB_CFG_REG |= I2C_UDB_CFG_STOP_IE; \
                                                    }while(0)

    #define I2C_UDB_DISABLE_INT_ON_STOP    do{ \
                                                        I2C_UDB_CFG_REG &=                                 \
                                                                           ((uint8) ~I2C_UDB_CFG_STOP_IE); \
                                                    }while(0)

    /* Transmit data */
    #define I2C_UDB_TRANSMIT_DATA          do{ \
                                                        I2C_UDB_CSR_REG = I2C_UDB_CSR_TRANSMIT; \
                                                    }while(0)

    #define I2C_UDB_ACK_AND_TRANSMIT       do{ \
                                                        I2C_UDB_CSR_REG = (I2C_UDB_CSR_ACK |      \
                                                                                    I2C_UDB_CSR_TRANSMIT); \
                                                    }while(0)

    #define I2C_UDB_NAK_AND_TRANSMIT       do{ \
                                                        I2C_UDB_CSR_REG = I2C_UDB_CSR_NAK; \
                                                    }while(0)

    /* Special case: udb needs to ack, ff needs to nak */
    #define I2C_UDB_ACKNAK_AND_TRANSMIT    do{ \
                                                        I2C_UDB_CSR_REG  = (I2C_UDB_CSR_NAK |      \
                                                                                     I2C_UDB_CSR_TRANSMIT); \
                                                    }while(0)
    /* Receive data */
    #define I2C_UDB_ACK_AND_RECEIVE        do{ \
                                                        I2C_UDB_CSR_REG = I2C_UDB_CSR_ACK; \
                                                    }while(0)

    #define I2C_UDB_NAK_AND_RECEIVE        do{ \
                                                        I2C_UDB_CSR_REG = I2C_UDB_CSR_NAK; \
                                                    }while(0)

    #define I2C_UDB_READY_TO_READ          do{ \
                                                        I2C_UDB_CSR_REG = I2C_UDB_CSR_RDY_TO_RD; \
                                                    }while(0)

    /* Release bus after lost arbitration */
    #define I2C_UDB_BUS_RELEASE    I2C_UDB_READY_TO_READ

    /* Master Start/ReStart/Stop conditions generation */
    #define I2C_UDB_GENERATE_START         do{ \
                                                        I2C_UDB_MCSR_REG = I2C_UDB_MCSR_START_GEN; \
                                                    }while(0)

    #define I2C_UDB_GENERATE_RESTART \
                    do{                       \
                        I2C_UDB_MCSR_REG = (I2C_UDB_MCSR_RESTART_GEN | \
                                                     I2C_UDB_MCSR_STOP_GEN);    \
                        I2C_UDB_CSR_REG  = I2C_UDB_CSR_TRANSMIT;       \
                    }while(0)

