zsj-28/PSoC6_UDB_I2C_Master/CY8CPROTO-063-BLE_Master.cydsn/Generated_Source/PSoC6/I2C_UDB.h
    #define I2C_UDB_GENERATE_STOP \
                    do{                    \
                        I2C_UDB_MCSR_REG = I2C_UDB_MCSR_STOP_GEN; \
                        I2C_UDB_CSR_REG  = I2C_UDB_CSR_TRANSMIT;  \
                    }while(0)

    /* Master manual APIs compatible defines */
    #define I2C_UDB_GENERATE_START_MANUAL      I2C_UDB_GENERATE_START
    #define I2C_UDB_GENERATE_RESTART_MANUAL    I2C_UDB_GENERATE_RESTART
    #define I2C_UDB_GENERATE_STOP_MANUAL       I2C_UDB_GENERATE_STOP
    #define I2C_UDB_TRANSMIT_DATA_MANUAL       I2C_UDB_TRANSMIT_DATA
    #define I2C_UDB_READY_TO_READ_MANUAL       I2C_UDB_READY_TO_READ
    #define I2C_UDB_ACK_AND_RECEIVE_MANUAL     I2C_UDB_ACK_AND_RECEIVE
    #define I2C_UDB_BUS_RELEASE_MANUAL         I2C_UDB_BUS_RELEASE

#else

    /* Masks to enable interrupts from Status register */
    #define I2C_UDB_STOP_IE_MASK           (I2C_UDB_STS_STOP_MASK)
    #define I2C_UDB_BYTE_COMPLETE_IE_MASK  (I2C_UDB_STS_BYTE_COMPLETE_MASK)

    /* FF compatibility: CSR register bit-fields */
    #define I2C_UDB_CSR_LOST_ARB       (I2C_UDB_STS_LOST_ARB_MASK)
    #define I2C_UDB_CSR_STOP_STATUS    (I2C_UDB_STS_STOP_MASK)
    #define I2C_UDB_CSR_BUS_ERROR      (0x00u)
    #define I2C_UDB_CSR_ADDRESS        (I2C_UDB_STS_ADDR_MASK)
    #define I2C_UDB_CSR_TRANSMIT       (I2C_UDB_CTRL_TRANSMIT_MASK)
    #define I2C_UDB_CSR_LRB            (I2C_UDB_STS_LRB_MASK)
    #define I2C_UDB_CSR_LRB_NAK        (I2C_UDB_STS_LRB_MASK)
    #define I2C_UDB_CSR_LRB_ACK        (0x00u)
    #define I2C_UDB_CSR_BYTE_COMPLETE  (I2C_UDB_STS_BYTE_COMPLETE_MASK)

    /* FF compatibility: MCSR registers bit-fields */
    #define I2C_UDB_MCSR_REG           (I2C_UDB_CSR_REG)  /* UDB incorporates master and slave regs */
    #define I2C_UDB_MCSR_BUS_BUSY      (I2C_UDB_STS_BUSY_MASK)      /* Is bus is busy               */
    #define I2C_UDB_MCSR_START_GEN     (I2C_UDB_CTRL_START_MASK)    /* Generate Start condition     */
    #define I2C_UDB_MCSR_RESTART_GEN   (I2C_UDB_CTRL_RESTART_MASK)  /* Generates RESTART condition  */
    #define I2C_UDB_MCSR_MSTR_MODE     (I2C_UDB_STS_MASTER_MODE_MASK)/* Define if active Master     */

    /* Data to write into TX FIFO to release FSM */
    #define I2C_UDB_PREPARE_TO_RELEASE (0xFFu)
    #define I2C_UDB_RELEASE_FSM        (0x00u)

    /* Define release command done: history of byte complete status is cleared */
    #define I2C_UDB_WAIT_RELEASE_CMD_DONE  (I2C_UDB_RELEASE_FSM != I2C_UDB_GO_DONE_REG)

    /* Check enable of module */
    #define I2C_UDB_I2C_ENABLE_REG     (I2C_UDB_CFG_REG)
    #define I2C_UDB_IS_I2C_ENABLE(reg) ((0u != ((reg) & I2C_UDB_ENABLE_MASTER)) || \
                                                 (0u != ((reg) & I2C_UDB_ENABLE_SLAVE)))

    #define I2C_UDB_IS_ENABLED         (0u != (I2C_UDB_CFG_REG & I2C_UDB_ENABLE_MS))

    /* Check start condition generation */
    #define I2C_UDB_CHECK_START_GEN(mcsr)  ((0u != (I2C_UDB_CFG_REG &        \
                                                             I2C_UDB_MCSR_START_GEN)) \
                                                    &&                                         \
                                                    (0u == ((mcsr) & I2C_UDB_MCSR_MSTR_MODE)))

    #define I2C_UDB_CLEAR_START_GEN        do{ \
                                                        I2C_UDB_CFG_REG &=                 \
                                                        ((uint8) ~I2C_UDB_MCSR_START_GEN); \
                                                    }while(0)

    /* Stop interrupt */
    #define I2C_UDB_ENABLE_INT_ON_STOP     do{ \
                                                       I2C_UDB_INT_MASK_REG |= I2C_UDB_STOP_IE_MASK; \
                                                    }while(0)

    #define I2C_UDB_DISABLE_INT_ON_STOP    do{ \
                                                        I2C_UDB_INT_MASK_REG &=                               \
                                                                             ((uint8) ~I2C_UDB_STOP_IE_MASK); \
                                                    }while(0)

    /* Transmit data */
    #define I2C_UDB_TRANSMIT_DATA \
                                    do{    \
                                        I2C_UDB_CFG_REG     = (I2C_UDB_CTRL_TRANSMIT_MASK | \
                                                                       I2C_UDB_CTRL_DEFAULT);        \
                                        I2C_UDB_GO_DONE_REG = I2C_UDB_PREPARE_TO_RELEASE;   \
                                        I2C_UDB_GO_REG      = I2C_UDB_RELEASE_FSM;          \
                                    }while(0)

    #define I2C_UDB_ACK_AND_TRANSMIT   I2C_UDB_TRANSMIT_DATA

    #define I2C_UDB_NAK_AND_TRANSMIT \
                                        do{   \
                                            I2C_UDB_CFG_REG     = (I2C_UDB_CTRL_NACK_MASK     | \
                                                                            I2C_UDB_CTRL_TRANSMIT_MASK | \
                                                                            I2C_UDB_CTRL_DEFAULT);       \
                                            I2C_UDB_GO_DONE_REG = I2C_UDB_PREPARE_TO_RELEASE;   \
                                            I2C_UDB_GO_REG      = I2C_UDB_RELEASE_FSM;          \
                                        }while(0)

    /* Receive data */
    #define I2C_UDB_READY_TO_READ  \
                                        do{ \
                                            I2C_UDB_CFG_REG     = I2C_UDB_CTRL_DEFAULT;       \
                                            I2C_UDB_GO_DONE_REG = I2C_UDB_PREPARE_TO_RELEASE; \
                                            I2C_UDB_GO_REG      = I2C_UDB_RELEASE_FSM;       \
                                        }while(0)

    #define I2C_UDB_ACK_AND_RECEIVE    I2C_UDB_READY_TO_READ

    /* Release bus after arbitration is lost */
    #define I2C_UDB_BUS_RELEASE    I2C_UDB_READY_TO_READ

    #define I2C_UDB_NAK_AND_RECEIVE \
                                        do{  \
                                            I2C_UDB_CFG_REG     = (I2C_UDB_CTRL_NACK_MASK |   \
                                                                            I2C_UDB_CTRL_DEFAULT);     \
                                            I2C_UDB_GO_DONE_REG = I2C_UDB_PREPARE_TO_RELEASE; \
                                            I2C_UDB_GO_REG      = I2C_UDB_RELEASE_FSM;       \
                                        }while(0)

    /* Master condition generation */
    #define I2C_UDB_GENERATE_START \
                                        do{ \
                                            I2C_UDB_CFG_REG     = (I2C_UDB_CTRL_START_MASK |  \
                                                                            I2C_UDB_CTRL_DEFAULT);     \
                                            I2C_UDB_GO_DONE_REG = I2C_UDB_PREPARE_TO_RELEASE; \
                                            I2C_UDB_GO_REG      = I2C_UDB_RELEASE_FSM;       \
                                        }while(0)

    #define I2C_UDB_GENERATE_RESTART \
                                        do{   \
                                            I2C_UDB_CFG_REG     = (I2C_UDB_CTRL_RESTART_MASK | \
                                                                            I2C_UDB_CTRL_NACK_MASK    | \
                                                                            I2C_UDB_CTRL_DEFAULT);      \
                                            I2C_UDB_GO_DONE_REG = I2C_UDB_PREPARE_TO_RELEASE;  \
                                            I2C_UDB_GO_REG  =     I2C_UDB_RELEASE_FSM;         \
                                        }while(0)

    #define I2C_UDB_GENERATE_STOP  \
                                        do{ \
                                            I2C_UDB_CFG_REG    = (I2C_UDB_CTRL_NACK_MASK |    \
                                                                           I2C_UDB_CTRL_STOP_MASK |    \
                                                                           I2C_UDB_CTRL_DEFAULT);      \
                                            I2C_UDB_GO_DONE_REG = I2C_UDB_PREPARE_TO_RELEASE; \
                                            I2C_UDB_GO_REG      = I2C_UDB_RELEASE_FSM;        \
                                        }while(0)

