zsj-28/PSoC6_UDB_I2C_Master/CY8CPROTO-063-BLE_Master.cydsn/Generated_Source/PSoC6/I2C_UDB.h
    /* Master manual APIs compatible macros */
    /* These macros wait until byte complete history is cleared after command issued */
    #define I2C_UDB_GENERATE_START_MANUAL \
                                        do{ \
                                            I2C_UDB_GENERATE_START;                  \
                                            /* Wait until byte complete history is cleared */ \
                                            while(I2C_UDB_WAIT_RELEASE_CMD_DONE)     \
                                            {                                                 \
                                            }                                                 \
                                        }while(0)
                                        
    #define I2C_UDB_GENERATE_RESTART_MANUAL \
                                        do{          \
                                            I2C_UDB_GENERATE_RESTART;                \
                                            /* Wait until byte complete history is cleared */ \
                                            while(I2C_UDB_WAIT_RELEASE_CMD_DONE)     \
                                            {                                                 \
                                            }                                                 \
                                        }while(0)

    #define I2C_UDB_GENERATE_STOP_MANUAL \
                                        do{       \
                                            I2C_UDB_GENERATE_STOP;                   \
                                            /* Wait until byte complete history is cleared */ \
                                            while(I2C_UDB_WAIT_RELEASE_CMD_DONE)     \
                                            {                                                 \
                                            }                                                 \
                                        }while(0)

    #define I2C_UDB_TRANSMIT_DATA_MANUAL \
                                        do{       \
                                            I2C_UDB_TRANSMIT_DATA;                   \
                                            /* Wait until byte complete history is cleared */ \
                                            while(I2C_UDB_WAIT_RELEASE_CMD_DONE)     \
                                            {                                                 \
                                            }                                                 \
                                        }while(0)

    #define I2C_UDB_READY_TO_READ_MANUAL \
                                        do{       \
                                            I2C_UDB_READY_TO_READ;                   \
                                            /* Wait until byte complete history is cleared */ \
                                            while(I2C_UDB_WAIT_RELEASE_CMD_DONE)     \
                                            {                                                 \
                                            }                                                 \
                                        }while(0)

    #define I2C_UDB_ACK_AND_RECEIVE_MANUAL \
                                        do{         \
                                            I2C_UDB_ACK_AND_RECEIVE;                 \
                                            /* Wait until byte complete history is cleared */ \
                                            while(I2C_UDB_WAIT_RELEASE_CMD_DONE)     \
                                            {                                                 \
                                            }                                                 \
                                        }while(0)

    #define I2C_UDB_BUS_RELEASE_MANUAL I2C_UDB_READY_TO_READ_MANUAL

#endif /* (I2C_UDB_FF_IMPLEMENTED) */


/***************************************
*     Default register init constants
***************************************/

#define I2C_UDB_DISABLE    (0u)
#define I2C_UDB_ENABLE     (1u)

#if (I2C_UDB_FF_IMPLEMENTED)
    /* I2C_UDB_XCFG_REG: bits definition */
    #define I2C_UDB_DEFAULT_XCFG_HW_ADDR_EN ((I2C_UDB_HW_ADRR_DECODE) ? \
                                                        (I2C_UDB_XCFG_HDWR_ADDR_EN) : (0u))

    #define I2C_UDB_DEFAULT_XCFG_I2C_ON    ((I2C_UDB_WAKEUP_ENABLED) ? \
                                                        (I2C_UDB_XCFG_I2C_ON) : (0u))


    #define I2C_UDB_DEFAULT_CFG_SIO_SELECT ((I2C_UDB_I2C1_SIO_PAIR) ? \
                                                        (I2C_UDB_CFG_SIO_SELECT) : (0u))


    /* I2C_UDB_CFG_REG: bits definition */
    #define I2C_UDB_DEFAULT_CFG_PSELECT    ((I2C_UDB_WAKEUP_ENABLED) ? \
                                                        (I2C_UDB_CFG_PSELECT) : (0u))

    #define I2C_UDB_DEFAULT_CLK_RATE0  ((I2C_UDB_DATA_RATE <= 50u) ?        \
                                                    (I2C_UDB_CFG_CLK_RATE_050) :     \
                                                    ((I2C_UDB_DATA_RATE <= 100u) ?   \
                                                        (I2C_UDB_CFG_CLK_RATE_100) : \
                                                        (I2C_UDB_CFG_CLK_RATE_400)))

    #define I2C_UDB_DEFAULT_CLK_RATE1  ((I2C_UDB_DATA_RATE <= 50u) ?           \
                                                 (I2C_UDB_CFG_CLK_RATE_LESS_EQUAL_50) : \
                                                 (I2C_UDB_CFG_CLK_RATE_GRATER_50))

    #define I2C_UDB_DEFAULT_CLK_RATE   (I2C_UDB_DEFAULT_CLK_RATE1)


    #define I2C_UDB_ENABLE_MASTER      ((I2C_UDB_MODE_MASTER_ENABLED) ? \
                                                 (I2C_UDB_CFG_EN_MSTR) : (0u))

    #define I2C_UDB_ENABLE_SLAVE       ((I2C_UDB_MODE_SLAVE_ENABLED) ? \
                                                 (I2C_UDB_CFG_EN_SLAVE) : (0u))

    #define I2C_UDB_ENABLE_MS      (I2C_UDB_ENABLE_MASTER | I2C_UDB_ENABLE_SLAVE)


