zsj-28/PSoC6_UDB_I2C_Master/CY8CPROTO-063-BLE_Master.cydsn/Generated_Source/PSoC6/I2C_UDB.h
    /* I2C_UDB_DEFAULT_XCFG_REG */
    #define I2C_UDB_DEFAULT_XCFG   (I2C_UDB_XCFG_CLK_EN         | \
                                             I2C_UDB_DEFAULT_XCFG_I2C_ON | \
                                             I2C_UDB_DEFAULT_XCFG_HW_ADDR_EN)

    /* I2C_UDB_DEFAULT_CFG_REG */
    #define I2C_UDB_DEFAULT_CFG    (I2C_UDB_DEFAULT_CFG_SIO_SELECT | \
                                             I2C_UDB_DEFAULT_CFG_PSELECT    | \
                                             I2C_UDB_DEFAULT_CLK_RATE       | \
                                             I2C_UDB_ENABLE_MASTER          | \
                                             I2C_UDB_ENABLE_SLAVE)

    /*I2C_UDB_DEFAULT_DIVIDE_FACTOR_REG */
    #define I2C_UDB_DEFAULT_DIVIDE_FACTOR  ((uint16) 2u)

#else
    /* I2C_UDB_CFG_REG: bits definition  */
    #define I2C_UDB_ENABLE_MASTER  ((I2C_UDB_MODE_MASTER_ENABLED) ? \
                                             (I2C_UDB_CTRL_ENABLE_MASTER_MASK) : (0u))

    #define I2C_UDB_ENABLE_SLAVE   ((I2C_UDB_MODE_SLAVE_ENABLED) ? \
                                             (I2C_UDB_CTRL_ENABLE_SLAVE_MASK) : (0u))

    #define I2C_UDB_ENABLE_MS      (I2C_UDB_ENABLE_MASTER | I2C_UDB_ENABLE_SLAVE)


    #define I2C_UDB_DEFAULT_CTRL_ANY_ADDR   ((I2C_UDB_HW_ADRR_DECODE) ? \
                                                      (0u) : (I2C_UDB_CTRL_ANY_ADDRESS_MASK))

    /* I2C_UDB_DEFAULT_CFG_REG */
    #define I2C_UDB_DEFAULT_CFG    (I2C_UDB_DEFAULT_CTRL_ANY_ADDR)

    /* All CTRL default bits to be used in macro */
    #define I2C_UDB_CTRL_DEFAULT   (I2C_UDB_DEFAULT_CTRL_ANY_ADDR | I2C_UDB_ENABLE_MS)

    /* Master clock generator: d0 and d1 */
    #define I2C_UDB_MCLK_PERIOD_VALUE  (0x0Fu)
    #define I2C_UDB_MCLK_COMPARE_VALUE (0x08u)

    /* Slave bit-counter: control period */
    #define I2C_UDB_PERIOD_VALUE       (0x07u)

    /* I2C_UDB_DEFAULT_INT_MASK */
    #define I2C_UDB_DEFAULT_INT_MASK   (I2C_UDB_BYTE_COMPLETE_IE_MASK)

    /* I2C_UDB_DEFAULT_MCLK_PRD_REG */
    #define I2C_UDB_DEFAULT_MCLK_PRD   (I2C_UDB_MCLK_PERIOD_VALUE)

    /* I2C_UDB_DEFAULT_MCLK_CMP_REG */
    #define I2C_UDB_DEFAULT_MCLK_CMP   (I2C_UDB_MCLK_COMPARE_VALUE)

    /* I2C_UDB_DEFAULT_PERIOD_REG */
    #define I2C_UDB_DEFAULT_PERIOD     (I2C_UDB_PERIOD_VALUE)

#endif /* (I2C_UDB_FF_IMPLEMENTED) */


/***************************************
* The following code is DEPRECATED and
* should not be used in new projects.
***************************************/

#define I2C_UDB_SSTAT_RD_ERR       (0x08u)
#define I2C_UDB_SSTAT_WR_ERR       (0x80u)
#define I2C_UDB_MSTR_SLAVE_BUSY    (I2C_UDB_MSTR_NOT_READY)
#define I2C_UDB_MSTAT_ERR_BUF_OVFL (0x80u)
#define I2C_UDB_SSTAT_RD_CMPT      (I2C_UDB_SSTAT_RD_CMPLT)
#define I2C_UDB_SSTAT_WR_CMPT      (I2C_UDB_SSTAT_WR_CMPLT)
#define I2C_UDB_MODE_MULTI_MASTER_ENABLE    (I2C_UDB_MODE_MULTI_MASTER_MASK)
#define I2C_UDB_DATA_RATE_50       (50u)
#define I2C_UDB_DATA_RATE_100      (100u)
#define I2C_UDB_DEV_MASK           (0xF0u)
#define I2C_UDB_SM_SL_STOP         (0x14u)
#define I2C_UDB_SM_MASTER_IDLE     (0x40u)
#define I2C_UDB_HDWR_DECODE        (0x01u)

#endif /* CY_I2C_I2C_UDB_H */


/* [] END OF FILE */
